## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.api_request`                                                |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.api_request will be created
  + resource "aws_cloudwatch_log_subscription_filter" "api_request" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "?INFO ?WARNING ?ERROR"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/url-shortener-api"
      + name            = "API request"
      + role_arn        = (known after apply)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloudwatch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:58",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::806721586252:role/SentinelForwarderLambda-sentinel-cloudwatch-forwarder"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-production"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive value)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloudwatch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:806721586252:log-group:/aws/lambda/url-shortener-api:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloudwatch-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
